import numpy as np

# Функція, яку треба проінтегрувати
def f(x):
    return x / (3 + 2 * x ** 2)

# Межі інтегрування
a = 1  # Нижня межа
b = 2  # Верхня межа

# Кількість частин, на які розбиваємо інтервал
n = 100

# Ширина кожної частини
h = (b - a) / n

# Масив точок, в яких обчислюємо значення функції
x = np.linspace(a, b, n, endpoint=False)

# Масив значень функції в цих точках
y = f(x)

print(x)
print(y)

# Площа прямокутників
S = h * y

# Сума площ прямокутників - наближене значення інтегралу
I = np.sum(S)

# Знаходимо точне значення інтегралу
def F(x):
    return 1/4 * np.log(x**2 + 3/2)

exact = F(b) - F(a)

# Обчислюємо похибку
e = abs(I - exact) / exact

# Виводимо результати
print("Наближене значення інтегралу:")
print(I)
print("Точне значення інтегралу:")
print(exact)
print("Похибка:")
print(e)
