# МЕТОД ПОДІЛУ ДІЛЯНКИ НАВПІЛ

import numpy as np

# Визначаємо функцію, яку хочемо розв'язати
def f(x):
    return x - x**2

# Визначаємо інтервал, на якому шукаємо корінь
a = -3 # Ліва межа
b = 2 # Права межа

# Визначаємо точність, з якою хочемо знайти корінь
eps = 0.001 # Бажана похибка

count = 0
# Використовуємо метод поділу ділянки навпіл, поки не досягнемо бажаної точності
while abs(b - a) > eps:
    count += 1


    # Знаходимо середину інтервалу

    c = (a + b) / 2

    # Перевіряємо, чи змінюється знак функції на підінтервалах [a, c] та [c, b]
    if f(a) * f(c) < 0:
        # Якщо знак змінюється на [a, c], то корінь лежить на цьому підінтервалі
        # Звужуємо інтервал до [a, c]
        b = c
    else:
        # Якщо знак змінюється на [c, b], то корінь лежить на цьому підінтервалі
        # Звужуємо інтервал до [c, b]
        a = c
    print(f"Iтерація {count}: a = {a}, b = {b}")

# Виводимо наближене значення кореня та значення функції в цій точці
print(f"Корінь рівняння: {c}")
print(f"Значення функції в цій точці дорівнює {f(c)}")
print(f"Кількість ітерацій: {count}")

