#Явний метод Ейлера

import numpy as np

# Функція, яку треба проінтегрувати
def f (x):
    return x / (3 + 2 * x ** 2)

# Межі інтегрування
a = 1 # Нижня межа
b = 3 # Верхня межа

# Кількість частин, на які розбиваємо інтервал
n = 100

# Ширина кожної частини
h = (b - a) / n

# Масив точок, в яких обчислюємо значення функції
x = np.linspace (a, b, n, endpoint=False)

# Масив значень функції в цих точках
y = f (x)

# Площа прямокутників
S = h * y

# Сума площ прямокутників - наближене значення інтегралу
I = np.sum (S)

# Виводимо результат
print ("Наближене значення інтегралу:")
print (I)
